Extensions/АБ/Catalogs/ДокументыПредприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДокументыПредприятия</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УВМ_ВидАгентскогоДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыАгентскихДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КоличествоДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НалогообложениеНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыНалогообложенияНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НалогообложениеНДСОпределяетсяВДокументе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПроцентНеустойки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ВариантДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ВариантыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ТипНеустойки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_ТипыНеустойки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бессрочный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВопросДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВременныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дело</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.РегистрационныйНомер</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФормаДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПлощадьНежилогоПомещения</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПлощадьЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ЭтажЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КадастровыйНомерЗдания</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_КадастровыйНомерУчастка</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_АдресОбъекта</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПередаваемоеОборудование</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОснованиеПраваСобственности</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СрокПередачиОбъектаАрендодателем</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_СрокПринятияОбъектаАрендатором</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_НДСВСоставеАренднойПлаты</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_АренднаяПлатаЗаПользованиеОборудованием</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ОснащениеИмущества</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ДополнительноПереданныеДокументыИПредметы</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УВМ_ПоказанияПриборовУчётаНаМоментПередачи</Name>
					<Comment>Задача 324174</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Стороны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДатаПодписи</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НаименованияСторон</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подписал</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подписан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Сторона</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УВМ_Основание</Name>
							<Comment>//Миляев 293293</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.АБ_ОтветственныеЛицаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>254</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УВМ_Почта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Установил</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Extensions/АБ/Enums/ВариантыФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыФормДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Бумажная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Электронная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>БумажнаяИлиЭлектронная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/Enums/ВариантыВажностиОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВариантыВажностиОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Высокая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Обычная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Низкая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/Catalogs/ДокументыПредприятия/Ext/ObjectModule.bsl
&ИзменениеИКонтроль("ОбработкаЗаполнения")
Процедура АБ_ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоНовый() Тогда 

		РегистрационныйНомер = "";
		ЧисловойНомер 	= 0;
		ДатаРегистрации = '00010101';
		ДатаСоздания 	= ТекущаяДатаСеанса();
		Зарегистрировал = Справочники.Сотрудники.ПустаяСсылка();
		Ответственный = Справочники.Сотрудники.ПустаяСсылка();
		ОтветственныйЗаХранение = Справочники.Сотрудники.ПустаяСсылка();
		Подготовил = Сотрудники.ОсновнойСотрудник();
		Подразделение = Сотрудники.ПодразделениеСотрудника(Подготовил);
		Создал	 	  = Подготовил;

		КоличествоЭкземпляров = 1;
		КоличествоЛистов 	 = 1;
		КоличествоПриложений = 0;
		ЛистовВПриложениях 	 = 0;
		Дело = Справочники.ДелаХраненияДокументов.ПустаяСсылка();
		СрокИсполнения = '00010101';

		Если Не ЗначениеЗаполнено(ВидДокумента) Тогда 
			ВидДокумента = Делопроизводство.ПолучитьВидДокументаПоУмолчанию(Ссылка);
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Организация) Тогда 
			Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		КонецЕсли;

		Если Константы.ИспользоватьГрифыДоступа.Получить() Тогда
			ГрифДоступа = Константы.ГрифДоступаПоУмолчанию.Получить();
		КонецЕсли;	

		Если ЗначениеЗаполнено(ВидДокумента) 
			И ПолучитьФункциональнуюОпцию("ИспользоватьСуммуВоВнутренних",
			Новый Структура("ВидДокумента", ВидДокумента)) Тогда
			Валюта = Делопроизводство.ПолучитьВалютуПоУмолчанию();
		КонецЕсли;	

		Если Не ЗначениеЗаполнено(Проект) Тогда
			Проект = РаботаСПроектами.ПолучитьПроектПоУмолчанию();
		КонецЕсли;

		ФормаДокумента = Перечисления.ВариантыФормДокументов.Бумажная;
		Адресат	= Справочники.Сотрудники.ПустаяСсылка();
		Важность = Перечисления.ВариантыВажностиОбъектов.Обычная;
		#Вставка
		//++dar 31.10.25 (290806)                     
		Если ДанныеЗаполнения = Неопределено Тогда
			Контрагент = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ", "УВМ_КонтрагентПоУмолчанию"));
		КонецЕсли;
		//--dar 31.10.25 (290806)
		#КонецВставки
	КонецЕсли;

	ОснованиеЗаполнения = ДанныеЗаполнения;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("Основание") Тогда
		ОснованиеЗаполнения = ДанныеЗаполнения.Основание;
	КонецЕсли;

	// Сначала заполняем данными шаблона - затем документа-основания.

	// Создание из шаблона.
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ШаблонДокумента") Тогда

		Шаблон = ДанныеЗаполнения.ШаблонДокумента;
		ШаблоныДокументов.ЗаполнитьРеквизитыДокументаПоШаблону(Шаблон, ЭтотОбъект);

	КонецЕсли;

	// Создание документов предприятия на основании других документов предприятия.
	Если ТипЗнч(ОснованиеЗаполнения) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеЗаполнения, 
		"Заголовок, НоменклатураДел, Контрагент, КонтактноеЛицо, Папка, Проект, ГрифДоступа, ВопросДеятельности, 
		|Организация, Сумма, Валюта, СуммаНДС, Товары, Важность, ВидДокумента.ИспользоватьВажность,
		|ВидДокумента.ЯвляетсяИсходящейКорреспонденцией, ВидДокумента.ЯвляетсяВходящейКорреспонденцией");

		КэшВидаДокумента = Делопроизводство.КэшВидаДокумента(ВидДокумента);		

		Если Не ЗначениеЗаполнено(Заголовок) Тогда
			Если КэшВидаДокумента.ЯвляетсяИсходящейКорреспонденцией Тогда
				Если РеквизитыОснования.ВидДокументаЯвляетсяВходящейКорреспонденцией Тогда
					Заголовок = СтрШаблон(НСтр("ru = 'Ответ ""%1""'"), РеквизитыОснования.Заголовок);
				ИначеЕсли Не РеквизитыОснования.ВидДокументаЯвляетсяИсходящейКорреспонденцией Тогда
					Заголовок = СтрШаблон(НСтр("ru = 'Отправка ""%1""'"), РеквизитыОснования.Заголовок);
				Иначе
					Заголовок = РеквизитыОснования.Заголовок;
				КонецЕсли;

			ИначеЕсли Не КэшВидаДокумента.ЯвляетсяВходящейКорреспонденцией Тогда			
				Заголовок = РеквизитыОснования.Заголовок;
			КонецЕсли;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(Организация) Тогда
			Организация = РеквизитыОснования.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(ВопросДеятельности) Тогда
			ВопросДеятельности = РеквизитыОснования.ВопросДеятельности;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Папка) Тогда
			Папка = РеквизитыОснования.Папка;
		КонецЕсли;

		Если КэшВидаДокумента.ИспользоватьВажность 
			И РеквизитыОснования.ВидДокументаИспользоватьВажность 
			И Важность = Перечисления.ВариантыВажностиОбъектов.Обычная 
			И Важность <> РеквизитыОснования.Важность Тогда
			Важность = РеквизитыОснования.Важность;
		КонецЕсли;

		Если Стороны.Количество() = 0 Тогда 
			Для каждого Строка Из ОснованиеЗаполнения.Стороны Цикл
				НоваяСтрока = Стороны.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Сторона, КонтактноеЛицо, Наименование");
			КонецЦикла;

		ИначеЕсли Стороны.Количество() = 1 Тогда 
			// Первая строка должна быть "Организацией", если она введена, то копируем только контрагентов
			ВведенаОрганизация = Неопределено;
			Для Каждого СтрокаСторона из Стороны Цикл 
				Если ЗначениеЗаполнено(СтрокаСторона.Сторона) 
					И ТипЗнч(СтрокаСторона.Сторона) = Тип("СправочникСсылка.Организации") Тогда 
					ВведенаОрганизация = СтрокаСторона.Сторона;
					Прервать;
				КонецЕсли;
			КонецЦикла;

			ПерваяСтрока = Истина;
			Для Каждого Строка Из ОснованиеЗаполнения.Стороны Цикл
				Если ВведенаОрганизация <> Неопределено И ЗначениеЗаполнено(Строка.Сторона) 
					И ТипЗнч(Строка.Сторона) = Тип("СправочникСсылка.Организации") Тогда 
					Продолжить;
				КонецЕсли;

				НоваяСтрока = Стороны.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Сторона, КонтактноеЛицо, Наименование");
			КонецЦикла;

		ИначеЕсли Стороны.Количество() = 2 И КэшВидаДокумента.ЯвляетсяЗаявкойНаОплату Тогда

			// В заявке на оплату всегда есть 2 стороны - плательщик и получатель
			// Плательщик - наша организация, получатель - контрагент из основания

			ОрганизацияОснования = Неопределено;
			КонтрагентОснования = Неопределено;

			Для Каждого СтрокаСтороныОснования Из ОснованиеЗаполнения.Стороны Цикл
				Если ЗначениеЗаполнено(СтрокаСтороныОснования.Сторона) Тогда
					Если ТипЗнч(СтрокаСтороныОснования.Сторона) = Тип("СправочникСсылка.Организации")
						И Не ЗначениеЗаполнено(ОрганизацияОснования) Тогда
						ОрганизацияОснования = СтрокаСтороныОснования;
					ИначеЕсли Не ЗначениеЗаполнено(КонтрагентОснования) Тогда
						КонтрагентОснования = СтрокаСтороныОснования;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

			Для Каждого Сторона Из Стороны Цикл
				Если Не ЗначениеЗаполнено(Сторона.Сторона) Тогда
					Если Сторона.Наименование = Справочники.НаименованияСторон.Плательщик Тогда
						Если ЗначениеЗаполнено(ОрганизацияОснования) Тогда
							ЗаполнитьЗначенияСвойств(Сторона, ОрганизацияОснования, "Сторона, КонтактноеЛицо");
						Иначе
							Сторона.Сторона = РеквизитыОснования.Организация;
						КонецЕсли;
					ИначеЕсли Сторона.Наименование = Справочники.НаименованияСторон.Получатель Тогда
						Если ЗначениеЗаполнено(КонтрагентОснования) Тогда
							ЗаполнитьЗначенияСвойств(Сторона, КонтрагентОснования, "Сторона, КонтактноеЛицо");
						Иначе
							Сторона.Сторона = РеквизитыОснования.Контрагент;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;

		КонецЕсли;

		Если Контрагенты.Количество() = 0 Тогда 
			Для каждого Строка Из ОснованиеЗаполнения.Контрагенты Цикл
				НоваяСтрока = Контрагенты.Добавить();
				НоваяСтрока.Контрагент = Строка.Контрагент;
				НоваяСтрока.КонтактноеЛицо = Строка.КонтактноеЛицо;
				НоваяСтрока.ПодписалОтКонтрагента = Строка.ПодписалОтКонтрагента;
			КонецЦикла;

			Если Не ЗначениеЗаполнено(Контрагент) Тогда
				Контрагент = РеквизитыОснования.Контрагент;
			КонецЕсли;
			Если Не ЗначениеЗаполнено(КонтактноеЛицо) Тогда
				КонтактноеЛицо = РеквизитыОснования.КонтактноеЛицо;
			КонецЕсли;
		КонецЕсли;

		Сумма = РеквизитыОснования.Сумма;
		СуммаНДС = РеквизитыОснования.СуммаНДС;
		Если Не ЗначениеЗаполнено(Валюта) Тогда
			Валюта = РеквизитыОснования.Валюта;
		КонецЕсли;

		Если Товары.Количество() = 0 И КэшВидаДокумента.ВестиУчетТоваровИУслуг Тогда
			ТоварыОснования = РеквизитыОснования.Товары.Выгрузить();
			РеквизитыНоменклатур = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(
			ТоварыОснования.ВыгрузитьКолонку("Номенклатура"), "СтавкаНДС, Цена, ЕдиницаИзмерения"); 
			Для Каждого Строка Из ТоварыОснования Цикл
				Если Не ЗначениеЗаполнено(Строка.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;

				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);

				РеквизитыНоменклатуры = РеквизитыНоменклатур.Получить(НоваяСтрока.Номенклатура);
				Если РеквизитыНоменклатуры <> Неопределено Тогда
					Если ЗначениеЗаполнено(РеквизитыНоменклатуры.Цена) Тогда 
						НоваяСтрока.Цена = РеквизитыНоменклатуры.Цена;
					КонецЕсли;
					Если ЗначениеЗаполнено(РеквизитыНоменклатуры.СтавкаНДС) Тогда 
						НоваяСтрока.СтавкаНДС = РеквизитыНоменклатуры.СтавкаНДС;
					КонецЕсли;

					Если ЗначениеЗаполнено(РеквизитыНоменклатуры.ЕдиницаИзмерения) Тогда 
						НоваяСтрока.ЕдиницаИзмерения = РеквизитыНоменклатуры.ЕдиницаИзмерения;
					КонецЕсли;
				КонецЕсли;

				Если НоваяСтрока.Количество = 0 Тогда 
					НоваяСтрока.Количество = 1;
				КонецЕсли;

				ДелопроизводствоКлиентСервер.ПересчитатьСуммуВСтрокеТЧ(НоваяСтрока, НоваяСтрока.СтавкаНДС);
			КонецЦикла;

			Если РеквизитыОснования.Сумма = ТоварыОснования.Итог("Сумма") Тогда 
				Сумма = Товары.Итог("Сумма");
			КонецЕсли;

			УчитыватьНДС = Делопроизводство.УчитыватьНДС(Организация);
			Если УчитыватьНДС Тогда 
				Если РеквизитыОснования.СуммаНДС = ТоварыОснования.Итог("СуммаНДС") Тогда 
					СуммаНДС = Товары.Итог("СуммаНДС");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(НоменклатураДел) Тогда
			НоменклатураДел = РеквизитыОснования.НоменклатураДел;
		КонецЕсли;

		Если Не ЗначениеЗаполнено(ГрифДоступа) Тогда
			ГрифДоступа = РеквизитыОснования.ГрифДоступа;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Проект) Тогда
			Проект = РеквизитыОснования.Проект;
		КонецЕсли;

	ИначеЕсли ТипЗнч(ОснованиеЗаполнения) = Тип("Массив")
		И ОснованиеЗаполнения.Количество() > 0
		И ТипЗнч(ОснованиеЗаполнения[0]) = Тип("СправочникСсылка.Файлы") Тогда

		Если ОснованиеЗаполнения.Количество() = 1 И Не ЗначениеЗаполнено(Заголовок) Тогда
			Заголовок = ОснованиеЗаполнения[0].ПолноеНаименование;
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам") И Не ЗначениеЗаполнено(Проект) Тогда
			Проекты = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(ОснованиеЗаполнения, "Проект");
			Проект = Проекты.Получить(ОснованиеЗаполнения[0]);
			Для Каждого Строка Из Проекты Цикл
				Если Строка.Значение <> Проект Тогда 
					Проект = Неопределено;
					Прервать;
				КонецЕсли;	
			КонецЦикла;	
		КонецЕсли;	

	ИначеЕсли ВстроеннаяПочтаКлиентСервер.ЭтоПисьмо(ОснованиеЗаполнения) Тогда

		ОснованиеЗаполненияОбъект = ОснованиеЗаполнения.ПолучитьОбъект();

		Если Не ЗначениеЗаполнено(Содержание) Тогда
			Содержание = ОснованиеЗаполненияОбъект.ПолучитьТекстовоеПредставлениеСодержанияПисьма();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Заголовок) Тогда
			Заголовок = ОснованиеЗаполненияОбъект.Тема;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Проект) Тогда
			Проект = ОснованиеЗаполненияОбъект.Проект;
		КонецЕсли;

	ИначеЕсли ТипЗнч(ОснованиеЗаполнения) = Тип("Структура") Тогда 

		ЗаполнитьИзСтруктуры(ОснованиеЗаполнения, "Заголовок", Заголовок);
		ЗаполнитьИзСтруктуры(ОснованиеЗаполнения, "Содержание", Содержание);
		ЗаполнитьИзСтруктуры(ОснованиеЗаполнения, "Комментарий", Комментарий);
		ЗаполнитьИзСтруктуры(ОснованиеЗаполнения, "СуммаДокумента", Сумма);
		ЗаполнитьИзСтруктуры(ОснованиеЗаполнения, "Папка", Папка);
		ЗаполнитьИзСтруктуры(ОснованиеЗаполнения, "Ответственный", Ответственный);

		Если ОснованиеЗаполнения.Свойство("Стороны")
			И ТипЗнч(ОснованиеЗаполнения.Стороны) = Тип("ТаблицаЗначений") Тогда

			Стороны.Очистить();
			Для Каждого Строка Из ОснованиеЗаполнения.Стороны Цикл
				НоваяСтрока = Стороны.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			КонецЦикла;

		ИначеЕсли Стороны.Количество() = 0 Тогда

			Если ЗначениеЗаполнено(Организация) Тогда
				НоваяСтрока = Стороны.Добавить();
				НоваяСтрока.Сторона = Организация;
			КонецЕсли;

			ОснованиеКонтрагент = Неопределено;
			ОснованиеЗаполнения.Свойство("Контрагент", ОснованиеКонтрагент);

			ОснованиеКонтактноеЛицо = Неопределено;
			ОснованиеЗаполнения.Свойство("КонтактноеЛицо", ОснованиеКонтактноеЛицо);

			ОснованиеПодписалОтКонтрагента = Неопределено; 
			ОснованиеЗаполнения.Свойство("ПодписалОтКонтрагента", ОснованиеПодписалОтКонтрагента);

			Если ЗначениеЗаполнено(ОснованиеКонтрагент)
				Или ЗначениеЗаполнено(ОснованиеКонтактноеЛицо)
				Или ЗначениеЗаполнено(ОснованиеПодписалОтКонтрагента) Тогда 
				НоваяСтрока = Стороны.Добавить();
				НоваяСтрока.Сторона = ОснованиеКонтрагент;
				НоваяСтрока.КонтактноеЛицо = ОснованиеКонтактноеЛицо;
				НоваяСтрока.Подписал = ОснованиеПодписалОтКонтрагента;

				НоваяСтрока = Контрагенты.Добавить();
				НоваяСтрока.Контрагент = ОснованиеКонтрагент;
				НоваяСтрока.КонтактноеЛицо = ОснованиеКонтактноеЛицо;
				НоваяСтрока.ПодписалОтКонтрагента = ОснованиеПодписалОтКонтрагента;
			КонецЕсли;

		КонецЕсли;

		// Локализация
		СтруктураИменПередаваемыхРеквизитов = ОбменСКонтрагентамиДОСервер.ИменаПередаваемыхРеквизитов();
		Для Каждого КлючИмяПередаваемогоРеквизита Из СтруктураИменПередаваемыхРеквизитов Цикл
			ИмяПередаваемогоРеквизита = КлючИмяПередаваемогоРеквизита.Ключ;
			Если ОснованиеЗаполнения.Свойство(ИмяПередаваемогоРеквизита) 
				И ЗначениеЗаполнено(ОснованиеЗаполнения[ИмяПередаваемогоРеквизита]) Тогда
				Если Метаданные.Справочники.ДокументыПредприятия.Реквизиты.Найти(ИмяПередаваемогоРеквизита) <> Неопределено Тогда
					ЭтотОбъект[ИмяПередаваемогоРеквизита] = ОснованиеЗаполнения[ИмяПередаваемогоРеквизита];
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		// Конец Локализация

	ИначеЕсли ТипЗнч(ОснованиеЗаполнения) = Тип("СправочникСсылка.Мероприятия") Тогда

		РеквизитыМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ОснованиеЗаполнения,
		"Наименование, ГрифДоступа, Организация, Проект, Организатор, ОрганизаторКонтактноеЛицо");

		Если Не ЗначениеЗаполнено(Заголовок) Тогда
			Если ВидДокумента.ЯвляетсяИсходящейКорреспонденцией Тогда
				Заголовок = СтрШаблон(НСтр("ru = 'Отправка ""%1""'"), РеквизитыМероприятия.Наименование);
			Иначе
				Заголовок = РеквизитыМероприятия.Наименование;
			КонецЕсли;
		КонецЕсли;

		ГрифДоступа = РеквизитыМероприятия.ГрифДоступа;
		Организация = РеквизитыМероприятия.Организация;
		Проект = РеквизитыМероприятия.Проект;

		Если ТипЗнч(РеквизитыМероприятия.Организатор) = Тип("СправочникСсылка.Контрагенты") Тогда

			Если Стороны.Количество() = 0 Тогда
				// Если стороны не заполнены - добавляем нового получателя.
				НоваяСтрока = Стороны.Добавить();
				НоваяСтрока.Сторона = РеквизитыМероприятия.Организатор;
				НоваяСтрока.КонтактноеЛицо = РеквизитыМероприятия.ОрганизаторКонтактноеЛицо;
			Иначе
				// Если стороны заполнены - пытаемся заполнить получателя, возможно есть подходящие.
				Для Каждого Сторона Из Стороны Цикл
					Если ЗначениеЗаполнено(Сторона.Сторона) Или ЗначениеЗаполнено(Сторона.КонтактноеЛицо) Тогда
						Продолжить;
					КонецЕсли;
					Сторона.Сторона = РеквизитыМероприятия.Организатор;
					Сторона.КонтактноеЛицо = РеквизитыМероприятия.ОрганизаторКонтактноеЛицо;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	Если Не ЗначениеЗаполнено(Тематика)
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ТематикаДокумента") Тогда
		Тематика = ДанныеЗаполнения.ТематикаДокумента;
	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура АБ_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	СтарыеРеквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дело, ВопросДеятельности, Контрагент, 
	|ВидДокумента");

	Если ЗначениеЗаполнено(РегистрационныйНомер) И ЗначениеЗаполнено(ДатаРегистрации) Тогда 
		Если Не Делопроизводство.НомерУникален(ЭтотОбъект) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Регистрационный номер не уникален!'"),
			ЭтотОбъект,
			"РегистрационныйНомер",, 
			Отказ);
		КонецЕсли;	
	КонецЕсли;

	Если ЗначениеЗаполнено(ВременныйНомер) Тогда 
		Если Не Делопроизводство.НомерУникален(ЭтотОбъект, Истина) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Временный номер не уникален!'"),
			ЭтотОбъект,
			"РегистрационныйНомер",, 
			Отказ);
		КонецЕсли;	
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьСуммуВоВнутренних", 
		Новый Структура("ВидДокумента", ВидДокумента)) Тогда 
		Если ЗначениеЗаполнено(Сумма) Тогда 
			ПроверяемыеРеквизиты.Добавить("Валюта");
		КонецЕсли;	
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоАдресатам", Новый Структура("ВидДокумента", ВидДокумента)) Тогда 
		ПроверяемыеРеквизиты.Добавить("Адресат");
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ВестиУчетПоПроектам")
		И ЗначениеЗаполнено(ВидДокумента) Тогда
		НастройкиУчетаПоПроектам = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидДокумента,
		"ОбязательноУказаниеПроекта, КонтролироватьУникальностьДокументаВРамкахПроекта");
		Если НастройкиУчетаПоПроектам.ОбязательноУказаниеПроекта Тогда
			ПроверяемыеРеквизиты.Добавить("Проект");
		КонецЕсли;
		Если НастройкиУчетаПоПроектам.КонтролироватьУникальностьДокументаВРамкахПроекта
			И Не РаботаСПроектами.ДокументУникален(ЭтотОбъект) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
			НСтр("ru = 'Уже есть %1 с проектом %2. Документ данного вида должен быть уникален в рамках проекта'"
			),
			ВидДокумента,
			Проект),
			ЭтотОбъект,
			"Проект",,
			Отказ);
		КонецЕсли;
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("УчитыватьСрокДействияДокумента", 
		Новый Структура("ВидДокумента", ВидДокумента)) Тогда 

		#Удаление
		Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		#КонецУдаления
			ПроверяемыеРеквизиты.Добавить("ДатаНачалаДействия");
			Если Не Бессрочный Тогда 
				ПроверяемыеРеквизиты.Добавить("ДатаОкончанияДействия");
				ПроверяемыеРеквизиты.Добавить("ПорядокПродления");
			КонецЕсли;
		#Удаление
		КонецЕсли;
		#КонецУдаления	

		Если ЗначениеЗаполнено(ДатаНачалаДействия) И ЗначениеЗаполнено(ДатаОкончанияДействия) 
			И ДатаНачалаДействия > ДатаОкончанияДействия Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дата окончания действия меньше, чем дата начала.'"),
			ЭтотОбъект,
			"ДатаОкончанияДействия",, 
			Отказ);
		КонецЕсли;	

	КонецЕсли;

	Если ЗначениеЗаполнено(Дело) Тогда 

		Если (СтарыеРеквизиты.Дело <> Дело Или СтарыеРеквизиты.ВидДокумента <> ВидДокумента)   
			И Не Делопроизводство.ДелоМожетСодержатьДокумент("ВидыДокументов", ВидДокумента, Дело) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
			НСтр("ru = 'Дело не может содержать документы с видом %1.'"),
			ВидДокумента),
			,
			"ДелоТекст",, 
			Отказ);
		КонецЕсли;

		Если (СтарыеРеквизиты.Дело <> Дело Или СтарыеРеквизиты.Контрагент <> Контрагент)   
			И Не Делопроизводство.ДелоМожетСодержатьДокумент("Контрагенты", Контрагент, Дело) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
			НСтр("ru = 'Дело не может содержать документы по контрагенту %1.'"),
			Контрагент),
			,
			"ДелоТекст",, 
			Отказ);
		КонецЕсли;

		Если (СтарыеРеквизиты.Дело <> Дело Или СтарыеРеквизиты.ВопросДеятельности <> ВопросДеятельности)   
			И Не Делопроизводство.ДелоМожетСодержатьДокумент("ВопросыДеятельности", ВопросДеятельности, Дело) Тогда 
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
			НСтр("ru = 'Дело не может содержать документы по вопросу деятельности %1.'"),
			ВопросДеятельности),
			,
			"ДелоТекст",, 
			Отказ);
		КонецЕсли;

	КонецЕсли;	

	// Проверим, что дело из которого переносится документ не закрыто
	Если ЗначениеЗаполнено(СтарыеРеквизиты.Дело) И СтарыеРеквизиты.Дело <> Дело Тогда
		РеквизитыДела = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтарыеРеквизиты.Дело,
		"ДелоЗакрыто, ПометкаУдаления");
		Если РеквизитыДела.ДелоЗакрыто И Не РеквизитыДела.ПометкаУдаления Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'Нельзя перенести документы из закрытого дела %1.'"), СтарыеРеквизиты.Дело),
			,
			"ДелоТекст",, 
			Отказ);
		КонецЕсли;	
	КонецЕсли;

	Делопроизводство.ПроверкаСвязейПриИзмененииВидаДокумента(ЭтотОбъект, Отказ);

	ВидДокументаКэш = Делопроизводство.КэшВидаДокумента(ВидДокумента);

	Если ВидДокументаКэш.ВестиУчетПоНоменклатуреДел Тогда
		Делопроизводство.ПроверитьСоответствиеНоменклатурыДел(ЭтотОбъект, Отказ);
	КонецЕсли;

	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям")
		И ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям", Новый Структура("ВидДокумента", ВидДокумента)) Тогда

		Если Не Делопроизводство.ДелоОтноситсяКОрганизации(ЭтотОбъект) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Дело не относится к организации документа.'"),
			,
			"ДелоТекст",, 
			Отказ);
		КонецЕсли;

		Если Не ВидДокументаКэш.ВестиУчетСторон И Не ЗначениеЗаполнено(Организация) Тогда

			ТекстСообщения = РедакцииКонфигурацииКлиентСервер.ОшибкаНеВыбранаОрганизация();
			ОбщегоНазначения.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"Организация",,
			Отказ);

		КонецЕсли;
	КонецЕсли;

	Если ВидДокументаКэш.ВестиУчетСторон Тогда
		Для Каждого Строка Из Стороны Цикл
			Если Строка.Подписан И Не ЗначениеЗаполнено(Строка.Подписал) Тогда 
				Если ЗначениеЗаполнено(Строка.Сторона) И ТипЗнч(Строка.Сторона) = Тип("СправочникСсылка.Контрагенты")
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Сторона, "ЮрФизЛицо") = 
					Перечисления.ЮрФизЛицо.ФизЛицо Тогда
					Продолжить;
				Иначе 
					НомерСтроки = Стороны.Индекс(Строка);
					ТекстОшибки = СтрШаблон(
					НСтр("ru = 'Для стороны ""%1"" не указан подписант'"), Строка.Сторона);

					ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект,
					"Стороны["+Формат(НомерСтроки, "ЧН=; ЧГ=")+"].Подписал",, Отказ);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	//Проверка табличной части Стороны на задвоения
	КоличествоСторон = Стороны.Количество();
	Если КоличествоСторон > 1 Тогда
		Для Инд1 = 0 По КоличествоСторон - 2 Цикл
			Для Инд2 = Инд1 + 1 По КоличествоСторон - 1 Цикл
				Если Стороны[Инд1].Сторона = Стороны[Инд2].Сторона
					И Стороны[Инд1].Подписал = Стороны[Инд2].Подписал Тогда 
					ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Сторона ""%1"" указана дважды в списке сторон'"),
					Стороны[Инд2].Сторона);

					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,ЭтотОбъект,
					"Стороны["+ Формат(Инд2, "ЧН=0; ЧГ=0") +"].Сторона",,Отказ);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;

	Если ВидДокументаКэш.ЯвляетсяЗаявкойНаОплату Тогда

		Если Не ЗначениеЗаполнено(Сумма) Тогда
			ТекстОшибки = НСтр("ru = 'Не введена сумма'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, 
			ЭтотОбъект, 
			"Сумма",,
			Отказ);
		КонецЕсли;

		ОтборСторон = Новый Структура("Наименование", Справочники.НаименованияСторон.Получатель);
		НайденныеСтороны = Стороны.НайтиСтроки(ОтборСторон);
		Если НайденныеСтороны.Количество() = 0 Или Не ЗначениеЗаполнено(НайденныеСтороны[0].Сторона) Тогда
			ТекстОшибки = НСтр("ru = 'Не заполнено поле ""Получатель""'");
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, , "Получатель", Отказ);
		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ВидДокумента) Тогда 
		Если ВидДокументаКэш.ОбязательноеУказаниеОтветственного И Не ЗначениеЗаполнено(Ответственный) Тогда

			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
			НСтр("ru = 'У документа вида ""%1"" должен быть обязательно указан ответственный.'"),
			ВидДокумента),
			ЭтотОбъект,
			"Ответственный",,
			Отказ);

		КонецЕсли;

		Если ВидДокументаКэш.ВестиУчетСторон Тогда
			РаботаСПодписямиДокументов.ПроверитьЗаполнениеСторон(
			ЭтотОбъект, Отказ, ВидДокументаКэш.ЯвляетсяЗаявкойНаОплату, ВидДокументаКэш.ВариантПодписания);
			Индекс = ПроверяемыеРеквизиты.Найти("Контрагенты.Контрагент");
			Если Индекс <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(Индекс);
			КонецЕсли;	
			Если ВидДокументаКэш.ЯвляетсяЗаявкойНаОплату Тогда
				Индекс = ПроверяемыеРеквизиты.Найти("Стороны.Сторона");
				Если Индекс <> Неопределено Тогда
					ПроверяемыеРеквизиты.Удалить(Индекс);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;

		Делопроизводство.ПроверитьЗаполнениеРеквизитовХранения(ЭтотОбъект, ПроверяемыеРеквизиты);
	КонецЕсли;

	Если ВидДокументаКэш.ВестиУчетПоТематикам Тогда 
		ПроверитьЗаполнениеТематики(ЭтотОбъект, Отказ);
	КонецЕсли;
	
	#Вставка 
	// +++ Миляев (293293) 2026-02-26
	ВидДокумента10_МыПоставщик  = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","ВД_ДоговорПоставкиМыПоставщик"),Неопределено);
	НаименованиеСтрон_Покупатель = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Сторона_Покупатель"),Неопределено);
	НаименованиеСтрон_Поставщик  = АБ_ВызовСервера.ЗначениеКонстантыИзРегистра(Новый Структура("Ключ","Сторона_Поставщик"),Неопределено);
	Если ЗначениеЗаполнено(ВидДокумента10_МыПоставщик) И ЭтотОбъект.ВидДокумента = ВидДокумента10_МыПоставщик тогда
		
		Для Каждого ЗаписьСторон из ЭтотОбъект.Стороны цикл
			Если ЗначениеЗаполнено(ЗаписьСторон.Сторона) 
				и (ЗаписьСторон.Наименование = НаименованиеСтрон_Поставщик ИЛИ ЗаписьСторон.Наименование = НаименованиеСтрон_Покупатель) тогда
				
				Если не ЗначениеЗаполнено(ЗаписьСторон.Подписал) тогда
					ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(
					НСтр("ru = 'У документа вида ""%1"" должно быть указан подписант в табличной части сторон'"),
					ВидДокумента),
					ЭтотОбъект,
					"Стороны.УВМ_Основание",,
					Отказ);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	// --- Миляев (293293) 2026-02-26
	#КонецВставки
	#Вставка
	//++dar 22.04.26 (324174)
	ОфисВидимостьАренды  = (УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыОфиса);
	СкладВидимостьАренды = (УВМ_ВариантДоговора = Перечисления.УВМ_ВариантыДоговоров.ДоговорАрендыСкладскихПомещений);
	ОбщаяВидимостьАренды = ОфисВидимостьАренды ИЛИ СкладВидимостьАренды;
	
	Если ОбщаяВидимостьАренды Тогда
		ПроверяемыеРеквизиты.Добавить("УВМ_ПлощадьНежилогоПомещения");
		ПроверяемыеРеквизиты.Добавить("УВМ_ПлощадьЗдания");
		ПроверяемыеРеквизиты.Добавить("УВМ_КадастровыйНомерЗдания");
		ПроверяемыеРеквизиты.Добавить("УВМ_АдресОбъекта");
		ПроверяемыеРеквизиты.Добавить("УВМ_ОснованиеПраваСобственности");
		ПроверяемыеРеквизиты.Добавить("УВМ_СрокПередачиОбъектаАрендодателем");
		ПроверяемыеРеквизиты.Добавить("УВМ_СрокПринятияОбъектаАрендатором");
		ПроверяемыеРеквизиты.Добавить("УВМ_ЕжемесячнаяПостояннаяЧастьАренднойПлаты");
		ПроверяемыеРеквизиты.Добавить("УВМ_НДСВСоставеАренднойПлаты");
		ПроверяемыеРеквизиты.Добавить("УВМ_ОснащениеИмущества");
		ПроверяемыеРеквизиты.Добавить("УВМ_ДополнительноПереданныеДокументыИПредметы");
		ПроверяемыеРеквизиты.Добавить("УВМ_ПоказанияПриборовУчётаНаМоментПередачи");
	КонецЕсли;
	
	Если ОфисВидимостьАренды Тогда
		ПроверяемыеРеквизиты.Добавить("УВМ_ЭтажЗдания");
	КонецЕсли;
	
	Если СкладВидимостьАренды Тогда
		ПроверяемыеРеквизиты.Добавить("УВМ_КадастровыйНомерУчастка");
		ПроверяемыеРеквизиты.Добавить("УВМ_ПередаваемоеОборудование");
		ПроверяемыеРеквизиты.Добавить("УВМ_АренднаяПлатаЗаПользованиеОборудованием");
	КонецЕсли;
	//--dar 22.04.26 (324174)
	
	//++dar 27.04.26 (324174)
	Если ЭтоНовый() Тогда
		Если НЕ ЗначениеЗаполнено(УВМ_ВариантДоговора) Тогда
			ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(
			НСтр("ru = 'У документа не заполнен тип договора'")),
			ЭтотОбъект,
			"УВМ_ВариантДоговора",,
			Отказ);
		КонецЕсли;
	КонецЕсли;
	//--dar 27.04.26 (324174)
	#КонецВставки
КонецПроцедуры

&После("ПередЗаписью")
Процедура АБ_ПередЗаписью(Отказ)
	//++dar 17.02.26 (309302)
	//++GIV 31032026 (320030)
	//Наименование формируется исходя из номера и даты регистрации, они должны быть заполнены раньше
	//Если НЕ ЗначениеЗаполнено(ДатаРегистрации) Тогда
	//	ДатаРегистрации = ТекущаяДатаСеанса();
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
	//	УВМ_ЗаполнитьРегистрационныйНомер();
	//КонецЕсли;               
	//--GIV 31032026 (320030)
	
	Если ФормаДокумента = Перечисления.ВариантыФормДокументов.Бумажная Тогда
		Для Каждого ТекСторона Из Стороны Цикл
			Если ТипЗнч(ТекСторона.Сторона) = Тип("СправочникСсылка.Контрагенты") И НЕ ЗначениеЗаполнено(ТекСторона.УВМ_Почта) Тогда
				ТекстИсключения = НСтр("ru = 'В таблице ""Стороны"" не заполнен email контрагента.'");
				ВызватьИсключение ТекстИсключения;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// добавляем новую почту контрагенту / контактному лицу
	ТекКонтрагент = Неопределено;
	ТекКонтактноеЛицо = Неопределено;
	РезультатСсылка = Неопределено;
	ТекПочты = "";
	Для Каждого ТекСторона Из Стороны Цикл
		Если ТипЗнч(ТекСторона.Сторона) = Тип("СправочникСсылка.Контрагенты") Тогда
			ТекКонтрагент = ТекСторона.Сторона;
			ТекКонтактноеЛицо = ТекСторона.КонтактноеЛицо;
			ТекПочты = ТекСторона.УВМ_Почта;
		КонецЕсли;
	КонецЦикла;
	
	МсвНовыеПочты = СтрРазделить(СтрЗаменить(ТекПочты, " ", ""), ", ", Ложь);
	МсвУжеЕстьПочты = Новый Массив;
	
	ПочтыКонтрагента = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ТекКонтрагент, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, , ТекущаяДатаСеанса());
	МсвПочтыКонтрагента = СтрРазделить(СтрЗаменить(ПочтыКонтрагента, " ", ""), ",", Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МсвУжеЕстьПочты, МсвПочтыКонтрагента, Истина);

	ПочтыКонтактногоЛица = УправлениеКонтактнойИнформацией.ПредставлениеКонтактнойИнформацииОбъекта(ТекКонтактноеЛицо, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица, , ТекущаяДатаСеанса());
	МсвПочтыКонтактногоЛица = СтрРазделить(СтрЗаменить(ПочтыКонтактногоЛица, " ", ""), ",", Ложь);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МсвУжеЕстьПочты, МсвПочтыКонтактногоЛица, Истина);
	
	МсвДобавитьПочту = ОбщегоНазначенияКлиентСервер.РазностьМассивов(МсвНовыеПочты, МсвУжеЕстьПочты);
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекПочта Из МсвДобавитьПочту Цикл
		Если ЗначениеЗаполнено(ТекКонтактноеЛицо) Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ТекКонтактноеЛицо, ТекПочта, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица, ТекущаяДатаСеанса(), Ложь);
		ИначеЕсли ЗначениеЗаполнено(ТекКонтрагент) Тогда
			УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(ТекКонтрагент, ТекПочта, Справочники.ВидыКонтактнойИнформации.EmailКонтрагента, ТекущаяДатаСеанса(), Ложь);
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	//--dar 17.02.26 (309302)
КонецПроцедуры

//++dar 17.02.26 (309302)
Процедура УВМ_ЗаполнитьРегистрационныйНомер()
	Нумератор = Нумерация.ПолучитьНумераторДокумента(ЭтотОбъект);
	Если Нумерация.ПроверитьСменуПериодаНумерации(ЭтотОбъект.ДатаРегистрации, Дата(1,1,1), Нумератор) Тогда 
		СформироватьЧисловойНомерДокумента(ЭтотОбъект);
		СформироватьСтроковыйНомерДокумента(ЭтотОбъект);
	Иначе
		СформироватьСтроковыйНомерДокумента(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

Процедура СформироватьЧисловойНомерДокумента(ТекущийОбъект)
	
	// сделал пустыми
	ПерепискаПоПредмету = Справочники.ДокументыПредприятия.ПустаяСсылка();
	НеДействуетВСоответствии = Справочники.ДокументыПредприятия.ПустаяСсылка();
	СвязанныйДокументДляНумерации = Справочники.ДокументыПредприятия.ПустаяСсылка();
	ВОтветНа = Справочники.ДокументыПредприятия.ПустаяСсылка();
	//
	
	СтруктураПараметров = НумерацияКлиентСервер.ПолучитьПараметрыНумерации(ТекущийОбъект);
	СтруктураПараметров.Вставить("ПерепискаПоПредмету",	ПерепискаПоПредмету);
	СтруктураПараметров.Вставить("НеДействуетВСоответствии", НеДействуетВСоответствии);
	СтруктураПараметров.Вставить("СвязанныйОбъект", СвязанныйДокументДляНумерации);
	СтруктураПараметров.Вставить("ПолученВОтветНа", ВОтветНа);
	
	Нумерация.СформироватьЧисловойНомерДокумента(СтруктураПараметров, ТекущийОбъект.ЧисловойНомер);
	
КонецПроцедуры

Процедура СформироватьСтроковыйНомерДокумента(ТекущийОбъект)
	
	// сделал пустыми
	ПерепискаПоПредмету = Справочники.ДокументыПредприятия.ПустаяСсылка();
	НеДействуетВСоответствии = Справочники.ДокументыПредприятия.ПустаяСсылка();
	СвязанныйДокументДляНумерации = Справочники.ДокументыПредприятия.ПустаяСсылка();
	ВОтветНа = Справочники.ДокументыПредприятия.ПустаяСсылка();
	//
	
	СтруктураПараметров = НумерацияКлиентСервер.ПолучитьПараметрыНумерации(ТекущийОбъект);
	СтруктураПараметров.Вставить("ПерепискаПоПредмету",	ПерепискаПоПредмету);
	СтруктураПараметров.Вставить("НеДействуетВСоответствии", НеДействуетВСоответствии);
	СтруктураПараметров.Вставить("СвязанныйОбъект", СвязанныйДокументДляНумерации);
	СтруктураПараметров.Вставить("ПолученВОтветНа", ВОтветНа);
	
	ОписанияОшибок = Новый СписокЗначений;
	Нумерация.СформироватьСтроковыйНомерДокумента(СтруктураПараметров, ТекущийОбъект.РегистрационныйНомер, ОписанияОшибок);
	
	Для Каждого ОписаниеОшибки Из ОписанияОшибок Цикл
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ОписаниеОшибки.Представление,,
			ОписаниеОшибки.Значение,
			"Объект");
	КонецЦикла;
	
КонецПроцедуры

//--dar 17.02.26 (309302)

//++GIV 31032026 (320030) //Наименование формируется исходя из номера и даты регистрации, они должны быть заполнены раньше
&Перед("ПередЗаписью") 
Процедура АБ_ПередЗаписью1(Отказ)
	Если НЕ ЗначениеЗаполнено(ДатаРегистрации) Тогда
		ДатаРегистрации = ТекущаяДатаСеанса();
		//++dar 29.04.26 (326008)
		Для Каждого ТекущаяСторона Из Стороны Цикл
			ТекущаяСторона.ДатаПодписи = ДатаРегистрации;
		КонецЦикла;
		//--dar 29.04.26 (326008)
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РегистрационныйНомер) Тогда
		УВМ_ЗаполнитьРегистрационныйНомер();
	КонецЕсли;        
КонецПроцедуры
//--GIV 31032026 (320030)
